------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
--- 上tag 给特殊 prefab
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

-------------------------------------------------------

local prefab_list = {
    "oasislake",                        --- 沙漠绿洲泉水
    "cave_entrance",                    --- 洞穴入口
    "cave_exit",                        --- 洞穴出口
    "cave_hole",                        --- 坑洞
    "pigking",                          --- 猪王
    "pond",                             --- 池塘
    "pond_mos",                         --- 沼泽池塘
    "pond_cave",                        --- 洞穴池塘
    "lava_pond",                        --- 岩浆池
    "moonbase",                         --- 月亮祭台
    "hotspring",                        --- 月岛温泉
    "wormhole",                         --- 虫洞
    "wormhole_limited_1",               --- 生病的虫洞
    "beequeenhive",                     --- 蜂王巢穴的坑
    "beequeenhivegrown",                --- 蜂王巢穴
    "charlie_stage_post",               --- 查理舞台
    "walrus_camp",                      --- 海象营地
    "monkeyisland_portal",              --- 非自然传送门（猴岛）
    "monkeyqueen",                      --- 猴岛女王
    "monkeypillar",                     --- 猴岛女王附近的柱子
    "gravestone",                       --- 墓碑
    "grotto_pool_big",                  --- 洞穴巨型玻璃池
    "grotto_pool_small",                --- 洞穴小型玻璃池

    "moonrockseed",                --- 天体宝珠
}

for k, prefab_name in pairs(prefab_list) do
    AddPrefabPostInit(
        prefab_name,
        function(inst)
            inst:AddTag("fwd_in_pdt_tag."..prefab_name)
        end
    )
end



