-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
--[[

    监听青蛙捕捉，即使捕捉也得正常分裂

]]--
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
AddPrefabPostInit(
    "frog",
    function(inst)
        if not TheWorld.ismastersim then
            return
        end
-- 回调函数

--- 监听捕捉的瞬间
        inst:ListenForEvent("trapped",function()
            -- 执行内部概率器
            if math.random(1000) <= 200 then  -- 20%概率

                inst:PushEvent("fwd_in_pdt_event.frog_split")

            end
            
        end)
    end)