--------------------------------------------------------------------------------------------------------------------------------------------
---- 给绿色法杖拆特殊装备用的
--------------------------------------------------------------------------------------------------------------------------------------------

local function Add_Weapon(prefab_name,ingredients)
    AddRecipeToFilter(prefab_name,"WEAPONS")
    AddRecipe2(
        prefab_name,            --  --  inst.prefab  实体名字
        ingredients or {}, 
        TECH.NONE, --- TECH.NONE
        {
            builder_tag = "fwd_in_pdt_special_hide_flag_012364987",    --------- -- 【builder_tag】只给指定tag的角色能制造这件物品，角色添加/移除 tag 都能立马解锁/隐藏该物品
            atlas = "images/inventoryimages/"..prefab_name..".xml",
            image = prefab_name..".tex",
        },
        {"WEAPONS"}
    )
    RemoveRecipeFromFilter("fwd_in_pdt_building_medical_check_up_machine","MODS") 
end
--------------------------------------------------------------------------------------------------------------------------------------------
--【笔记】
-- AddDeconstructRecipe(name, return_ingredients) 其中，name 是要添加配方的 prefab 名，return_ingredients 是分解后返还的材料
--------------------------------------------------------------------------------------------------------------------------------------------
-- 炽热长矛
--------------------------------------------------------------------------------------------------------------------------------------------
    AddDeconstructRecipe("fwd_in_pdt_equipment_blazing_spear",{ Ingredient("rope", 1) , Ingredient("flint", 1)  })
--------------------------------------------------------------------------------------------------------------------------------------------
-- 极寒长矛
--------------------------------------------------------------------------------------------------------------------------------------------
    AddDeconstructRecipe("fwd_in_pdt_equipment_frozen_spear",{ Ingredient("rope", 1) , Ingredient("flint", 1)  })
--------------------------------------------------------------------------------------------------------------------------------------------
-- 极寒火腿棒
--------------------------------------------------------------------------------------------------------------------------------------------
    AddDeconstructRecipe("fwd_in_pdt_equipment_blazing_hambat",{ Ingredient("hambat", 1) , Ingredient("fwd_in_pdt_item_ice_core", 2)  })
--------------------------------------------------------------------------------------------------------------------------------------------
-- 修复法杖
--------------------------------------------------------------------------------------------------------------------------------------------
    AddDeconstructRecipe("fwd_in_pdt_equipment_repair_staff",{ Ingredient("opalpreciousgem", 1) , Ingredient("fwd_in_pdt_item_ice_core", 1) ,Ingredient("fwd_in_pdt_item_flame_core", 1)  })
--------------------------------------------------------------------------------------------------------------------------------------------
-- 钱包
--------------------------------------------------------------------------------------------------------------------------------------------
    AddDeconstructRecipe("fwd_in_pdt_container_wallet",{ Ingredient("spidereggsack", 2) })
