-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
---- 初始化刷角色创建位置

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------



AddPlayerPostInit(function(inst)

    

    if not TheWorld.ismastersim then
        return
    end
    ----------------------------------------------------------------------------------------------------------
    ---- 通用数据存储器
    if inst.components.fwd_in_pdt_data == nil then
        inst:AddComponent("fwd_in_pdt_data")
    end
    ----------------------------------------------------------------------------------------------------------

    ----------------------------------------------------------------------------------------------------------
    ---- 初始化组件
    if inst.components.fwd_in_pdt_func == nil then
        inst:AddComponent("fwd_in_pdt_func")
    end
    inst.components.fwd_in_pdt_func:Init("player","rpc","cross_archived_data_sys","camera","picksound","pre_dodelta","vip","daily_task","jade_coin_sys")
    ----------------------------------------------------------------------------------------------------------
    ---------- 动作失败的话语组件
    inst:AddComponent("fwd_in_pdt_com_action_fail_reason")
    ----------------------------------------------------------------------------------------------------------
    inst:AddComponent("fwd_in_pdt_wellness") --- 体质值组件
    ----------------------------------------------------------------------------------------------------------

    -- inst.AnimState:SetBloomEffectHandle(resolvefilepath("shaders/mod_test_shader.ksh"))
    -- inst.AnimState:SetBloomEffectHandle("shaders/anim_bloom_ghost.ksh")

    -- inst.skeleton_prefab = "my_test_skeleton"
    ----------------------------------------------------------------------------------------------------------
end)
