-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
--- 日常系统，只会每天执行一次

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
AddPlayerPostInit(function(inst)
    if not TheWorld.ismastersim then
        return
    end


    inst.components.fwd_in_pdt_func:DailyTask_Add_Fn(function()
        inst:DoTaskInTime(1,function()
            print("FWD:日常系统执行")
        end)
    end)

end)