----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
--[[

    装饰物系统 核心代码 和 素材库

]]--
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

modimport("Key_Modules_Of_FWD_IN_PDT/14_building_decoration_sys/01_icons.lua")  
--- 素材库

modimport("Key_Modules_Of_FWD_IN_PDT/14_building_decoration_sys/02_test_and_mark_fn.lua")  
--- test 函数 和 mark 标记位

modimport("Key_Modules_Of_FWD_IN_PDT/14_building_decoration_sys/03_building_decorations.lua")  
--- UI执行逻辑

